{
  "backend/main.mo": "Motoko canister implementing products, carts, orders, loyalty points, redemptions, and user profiles with admin/user authorization and CRUD operations.",
  "feature_evidence.json": "Feature evidence mapping product-related frontend files to implemented requirements and components.",
  "frontend-file-summaries.txt": "Aggregated summaries describing each frontend file’s purpose across pages, components, hooks, and config.",
  "frontend/index.css": "Global Tailwind OKLCH color variables and base styling for light and dark themes.",
  "frontend/index.html": "Minimal HTML root that loads the React application entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for catalog, product, cart, checkout, orders, rewards, and admin pages.",
  "frontend/src/components/auth/AdminGate.tsx": "Wrapper that blocks or skeleton-loads content based on admin permission.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate showing a login prompt when the user is not authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login button triggering Internet Identity with loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first‑time authenticated users to enter their name and save their profile.",
  "frontend/src/components/layout/AccountSummary.tsx": "Renders a user account dropdown showing profile info, points, navigation links, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, auth-aware controls, footer, and content container.",
  "frontend/src/components/SupportWhatsAppLink.tsx": "Button linking to WhatsApp support with a preset message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Defines cart-related queries and mutations for fetching, adding, removing items, and placing orders via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login, logout, and persisted identity state.",
  "frontend/src/hooks/useProducts.ts": "Provides product queries and mutations for fetching, creating, updating, and toggling product activity via the actor.",
  "frontend/src/hooks/useQueries.ts": "Contains general user-related queries such as profile, admin status, points balance, and point redemption.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables for light and dark modes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and toggling active status of products using various product-related hooks and form dialogs.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, merges cart items with product data, allows quantity updates and removals, and shows totals.",
  "frontend/src/pages/CatalogPage.tsx": "Shows searchable and filterable product catalog with category tabs and empty-state handling for active products.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays checkout summary, calculates totals, shows order items, and places orders via a mutation hook.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a confirmation message after order placement with links to continue shopping or view rewards.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Placeholder page gated by auth that displays a coming-soon message for order history.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with image carousel, stock limits, and authenticated add‑to‑cart functionality.",
  "frontend/src/pages/RewardsPage.tsx": "Loyalty rewards page that displays the user’s points, checks redemption eligibility, and allows redeeming 20 points for cashback or a mystery box via mutation hooks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins like typography, container queries, and animations.",
  "project_state.json": "Project metadata describing requirements and implemented features for the Ryk Cart e‑commerce app, including loyalty points, WhatsApp support, and admin tools."
}