{
  "backend/main.mo": "Defines the backend actor with product, cart, order, redemption, and user-profile management plus admin bootstrap and access-control logic.",
  "backend/migration.mo": "Provides migration logic mapping old actor state to the new format while resetting bootstrapClaimed.",
  "feature_evidence.json": "Lists feature-evidence metadata mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend files, including pages, components, and hooks.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages in the AppShell layout.",
  "frontend/src/components/auth/AdminGate.tsx": "Handles admin access flow, enforcing II login, admin checks, bootstrap claim, and support info display.",
  "frontend/src/components/auth/AuthGate.tsx": "Protects child components by requiring Internet Identity login and shows a login card when unauthenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login button using Internet Identity with a loading state indicator.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter their name and saves the profile.",
  "frontend/src/components/layout/AccountSummary.tsx": "Displays user profile info, points, navigation shortcuts, and handles logout via a dropdown menu.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, navigation, footer, and integrates auth-related UI like profile setup and account controls.",
  "frontend/src/components/SupportWhatsAppLink.tsx": "Renders a configurable WhatsApp support button with optional icon and custom message.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUnlock.ts": "Manages admin unlock state with a hardcoded password stored in sessionStorage.",
  "frontend/src/hooks/useCart.ts": "Provides cart queries and mutations for fetching, adding, removing items, and placing orders using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, providing identity state, login, and logout logic.",
  "frontend/src/hooks/useProducts.ts": "Exposes product queries and mutations for listing, retrieving, creating, updating, and toggling product active state via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, admin status, bootstrap, points, and related mutations using an Internet Identity actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Provides an admin login form and unlock flow before rendering the admin product management page.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and toggling products with dialogs and form handling.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, calculates totals and points, and provides item removal and checkout navigation.",
  "frontend/src/pages/CatalogPage.tsx": "Shows a searchable, filterable product catalog with category tabs and admin detection.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays cart review, calculates totals and points, and handles placing orders with loading and empty-cart states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a success message after checkout with links to shop or view rewards.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Placeholder page behind AuthGate indicating order history is coming soon.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays product details with image carousel and quantity controls, allowing authenticated users to add items to the cart.",
  "frontend/src/pages/RewardsPage.tsx": "Shows the user’s points balance and allows redeeming rewards when enough points are available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for the app’s styling.",
  "project_state.json": "Defines the current project state for the Ryk cart e‑commerce app, including admin login issues, required features, architectural notes, and a flag indicating this is a fix request. It outlines functionalities like WhatsApp support, loyalty points, admin panel access, and known access problems."
}