{
  "backend/main.mo": "Main Motoko canister implementing products, carts, orders, loyalty points, redemptions, user profiles, and admin bootstrap via AccessControl.",
  "backend/migration.mo": "Migration module defining old/new actor state and passthrough run function returning unchanged state.",
  "feature_evidence.json": "Feature evidence document listing a frontend bootstrap-claim update with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in routing, UI, auth, admin workflow, and product/cart logic.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables for light/dark modes and base styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes inside a shared AppShell.",
  "frontend/src/components/auth/AdminGate.tsx": "Auth/admin gate handling II login, admin checks, bootstrap claim with password, error states, and debug panel.",
  "frontend/src/components/auth/AuthGate.tsx": "Simple authentication gate requiring Internet Identity login before showing children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login button triggering Internet Identity authentication with loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to enter their name and save it.",
  "frontend/src/components/layout/AccountSummary.tsx": "Displays user profile info, points, navigation links, and handles logout via Internet Identity.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, navigation, footer, profile setup, and account controls.",
  "frontend/src/components/SupportWhatsAppLink.tsx": "Reusable WhatsApp support link button with customizable message, label, and styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUnlock.ts": "Manages admin unlock state using a fixed password and sessionStorage.",
  "frontend/src/hooks/useCart.ts": "Provides cart queries and mutations including fetching, adding, removing items, and placing orders.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context for login, logout, stored identity handling, and status tracking.",
  "frontend/src/hooks/useProducts.ts": "Offers product-related queries and mutations including fetching, creating, updating, and toggling products.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate user profile, admin status, bootstrap availability, and caller principal using an actor backend.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for colors and layout styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdminPage.tsx": "Implements admin login flow using a password unlock and conditionally renders the admin product panel.",
  "frontend/src/pages/AdminProductsPage.tsx": "Displays and manages products with create, edit, and activation toggles, using admin authentication and product mutation hooks.",
  "frontend/src/pages/CartPage.tsx": "Shows the user's cart with product details, totals, and remove/checkout actions, using cart and product queries.",
  "frontend/src/pages/CatalogPage.tsx": "Renders the product catalog with search, category filtering, admin check, and loading/empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders the checkout flow, showing cart items, totals, and placing orders with navigation to confirmation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a confirmation message after an order is placed and links to shopping or rewards.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows a placeholder for future order history functionality behind an auth gate.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays product details with images and allows authenticated users to add items to the cart.",
  "frontend/src/pages/RewardsPage.tsx": "Shows the user's points balance and allows redeeming rewards when enough points are available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s state for building the Ryk Cart e‑commerce app, including admin password-only access, loyalty points rules, WhatsApp support, and known issues about the blocked admin panel."
}