{
  "kind": "build_request",
  "title": "Make it easy for admins to add products when the catalog is empty",
  "projectName": "Ryk cart",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add a clear empty-state experience on the Catalog (Shop) page when there are zero active products, explaining that no products are available yet and guiding an admin to add products via the Admin → Product Management page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "is my product nhi hyn wo kaisay add kron"
        ]
      },
      "acceptanceCriteria": [
        "When there are no active products, the Catalog page shows an empty-state panel instead of only the generic 'No products found' text.",
        "The empty state includes English guidance that products must be added from the Admin area (e.g., “If you are an admin, go to Admin → Product Management to add products.”).",
        "If the current user is an admin (based on the existing isAdmin query), the empty state includes a visible button that navigates to /admin.",
        "If the current user is not an admin, the empty state does not show an Admin navigation button and instead shows a short note indicating the admin area is restricted."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a small, always-available 'How to add products' help entry point for admins that explains the minimum steps to create a product (name, price, category, stock, optional image URLs) and where to find Product Management.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "is my product nhi hyn wo kaisay add kron"
        ]
      },
      "acceptanceCriteria": [
        "Admins can access a short help UI (e.g., a link/button in the Admin Products page header or a compact callout) that explains, in English, how to add products.",
        "The help content explicitly mentions that the Admin page is at /admin and the primary action is the existing “Add Product” button.",
        "The help content mentions that image URLs are entered one per line and are optional.",
        "No changes are required to Internet Identity hooks or immutable paths to deliver this help UI."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Improve the Admin Products page table empty/loading states so an admin can immediately tell whether products are missing vs. still loading.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "is my product nhi hyn wo kaisay add kron"
        ]
      },
      "acceptanceCriteria": [
        "While loading, the Admin Products page shows a clear loading indicator in the table area.",
        "When loading is complete and there are no products, the Admin Products page shows an explicit empty state (in English) such as “No products yet. Click ‘Add Product’ to create your first product.”",
        "When products exist, the current table rendering remains functional (edit and activate/deactivate actions still work)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui (shadcn components) and must not edit the immutable paths listed in SYSTEM_CONTEXT.",
    "Do not introduce any external services for product storage or image hosting; product images must continue to use user-provided URLs as currently supported."
  ],
  "nonGoals": [
    "Changing the backend product schema or admin authorization rules.",
    "Adding a new authentication provider (Internet Identity remains the only auth).",
    "Auto-generating or seeding products without an explicit user/admin action."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}