{
  "kind": "build_request",
  "title": "Fix /admin 'Access Denied' by repairing admin gating and bootstrap claim flow",
  "projectName": "Ryk cart",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the /admin access flow so an eligible user can reach the Admin password unlock screen instead of being stuck on an 'Access Denied' screen, while still requiring Internet Identity authentication before any admin access is granted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "access denied hi arha hy"
        ]
      },
      "acceptanceCriteria": [
        "When visiting /admin while signed out, the page shows an Internet Identity login prompt (no admin password form is shown yet).",
        "When visiting /admin while signed in and recognized as an admin by the backend, the admin password unlock form is shown, and after entering the correct password (miang275@) the Admin Products panel is displayed.",
        "When visiting /admin while signed in but not recognized as an admin, the page shows a clear English explanation and a path to proceed (bootstrap claim if available, otherwise principal + WhatsApp support)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update the frontend bootstrap-claim UI and logic to match the single-password admin bootstrap requirement: remove any username field/validation and ensure all user-facing text in this flow is English and does not mention a username.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "access denied hi arha hy"
        ]
      },
      "acceptanceCriteria": [
        "The 'Claim admin access' section (when bootstrap is available) only asks for a password (miang275@).",
        "No UI labels, placeholders, alerts, or error messages mention a username anywhere in the admin gating/bootstrap claim flow.",
        "Submitting the correct password triggers the backend bootstrap request and then re-checks admin status automatically (React Query invalidations), allowing the user to proceed without manually refreshing."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Repair backend admin bootstrap availability/admin recognition so that if no effective admin exists, bootstrap is available and successfully claiming bootstrap immediately grants the caller admin permissions that satisfy isCallerAdmin and admin-only mutations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "access denied hi arha hy"
        ]
      },
      "acceptanceCriteria": [
        "If the system has no effective admin configured, the backend bootstrap availability query returns true for an authenticated caller.",
        "After calling requestBootstrap successfully, subsequent calls to isCallerAdmin for the same caller return true.",
        "After successful bootstrap, the caller can perform admin-only mutations (createProduct/updateProduct/toggleProductActive) without receiving 'Unauthorized' traps.",
        "The bootstrap availability logic does not incorrectly return false due only to stale/incorrect adminInitialized state."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Improve the 'Access Denied' admin screen to help diagnose why the user is blocked by showing (in English) the caller Principal ID (with copy), whether bootstrap is currently available, and a WhatsApp support CTA to 03280941320 with a prefilled message containing the Principal ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "access denied hi arha hy"
        ]
      },
      "acceptanceCriteria": [
        "The Access Denied screen shows the caller Principal ID in a copyable, monospace field.",
        "The Access Denied screen displays the current bootstrap availability state (e.g., 'Bootstrap available: Yes/No') in a user-understandable way.",
        "A WhatsApp support button is present and opens WhatsApp chat to phone number 03280941320 with a prefilled message that includes the Principal ID."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a state upgrade is required.",
    "Do not edit any frontend files under the immutablePaths list in SYSTEM_CONTEXT.",
    "Use English for all user-facing text changed or added as part of this build request.",
    "Keep the existing rule that admin product mutations must still require backend-recognized admin privileges (password unlock alone must not grant backend admin permissions)."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Implementing real-time features (WebSockets/chat).",
    "Changing the admin password value (must remain miang275@)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}