{
  "kind": "build_request",
  "title": "Fix admin bootstrap so Access Denied can be resolved and admin panel becomes reachable",
  "projectName": "Ryk cart",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Fix the backend admin bootstrap flow so that when bootstrap is available, successfully claiming bootstrap grants the caller admin permissions immediately (so subsequent calls to isCallerAdmin return true and admin-only mutations like createProduct/updateProduct/toggleProductActive succeed), instead of trapping with \"Bootstrap failed: Admin permissions not granted\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "abhi bhi nhi ho rha"
        ]
      },
      "acceptanceCriteria": [
        "Given no admin is effectively configured and bootstrap is available, calling the bootstrap-claim method succeeds and the caller becomes an admin in the same session.",
        "After a successful bootstrap claim, a call to isCallerAdmin returns true for that caller.",
        "After a successful bootstrap claim, admin-only mutations (createProduct/updateProduct/toggleProductActive) succeed for that caller (assuming Internet Identity authentication is present).",
        "If bootstrap has already been claimed (or is otherwise unavailable), attempting to claim bootstrap fails with a clear error and does not change admin status."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the backend bootstrap availability logic to be accurate and side-effect-free: return true only when an initial admin can still be established (e.g., no effective admin exists yet and bootstrap has not been claimed), and return false otherwise.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "abhi bhi nhi ho rha"
        ]
      },
      "acceptanceCriteria": [
        "The bootstrap availability query does not modify state.",
        "Bootstrap availability returns false when an admin already exists, even if bootstrapClaimed is false.",
        "Bootstrap availability returns false after bootstrap has been successfully claimed."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Require the admin bootstrap claim to validate the admin password (miang275@) on the backend (not only on the frontend), and return a clear error when the password is incorrect.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "abhi bhi nhi ho rha"
        ]
      },
      "acceptanceCriteria": [
        "If the password is incorrect, the backend bootstrap claim fails and does not grant admin permissions and does not mark bootstrap as claimed.",
        "If the password is correct and bootstrap is available, the backend bootstrap claim succeeds and grants admin permissions to the caller.",
        "No frontend-only password check is relied on for security (frontend may still do client-side validation for UX, but backend must enforce it)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Persist bootstrap-related state across canister upgrades so that bootstrap availability and whether it has been claimed remain consistent after redeployments/upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "abhi bhi nhi ho rha"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, bootstrap availability and claimed status reflect the pre-upgrade values (no accidental reset that re-opens bootstrap or re-locks an already bootstrapped admin)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Update the frontend bootstrap-claim mutation to call the corrected backend bootstrap-claim method (including passing the password if required by the backend), and ensure the UI transitions correctly after success by invalidating/refetching admin status and bootstrap availability so the user can proceed to the Admin password unlock screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "abhi bhi nhi ho rha"
        ]
      },
      "acceptanceCriteria": [
        "From /admin, when logged in with Internet Identity and not an admin, if bootstrap is available and the user enters password miang275@, clicking “Claim Admin Access” results in the user becoming an admin without a page refresh.",
        "After a successful claim, the UI no longer shows the Access Denied gating screen and instead proceeds to the Admin password unlock screen (handled by AdminPage).",
        "If the backend returns an incorrect-password error, the UI shows a clear English error message and remains on the bootstrap claim screen."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any frontend files under frontend/src/components/ui or other immutablePaths specified in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing non-Internet-Identity authentication for admin access.",
    "Adding external databases or third-party auth providers.",
    "Changing the admin password value (must remain miang275@)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}