{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-friendly empty states for catalog and product management",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Add a guided empty-state on the Catalog (Shop) page when there are zero active products, with admin-aware call-to-action to go to Product Management.",
      "acceptanceCriteria": [
        "When there are no active products, the Catalog page shows an empty-state panel instead of only the generic 'No products found' text.",
        "The empty state includes English guidance that products must be added from the Admin area (e.g., “If you are an admin, go to Admin → Product Management to add products.”).",
        "If the current user is an admin (based on the existing isAdmin query), the empty state includes a visible button that navigates to /admin.",
        "If the current user is not an admin, the empty state does not show an Admin navigation button and instead shows a short note indicating the admin area is restricted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CatalogPage.tsx",
          "operation": "modify",
          "description": "Use the existing isAdmin query (via useIsAdmin from frontend/src/hooks/useQueries.ts) to render a dedicated empty-state panel when activeProducts.length === 0. Show English guidance to add products via Admin → Product Management; if isAdmin is true, show a Button that navigates to /admin; if isAdmin is false, omit the button and show a short note that the admin area is restricted. Keep the existing 'No products found' behavior for cases where products exist but filters/search return no matches. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add an always-available 'How to add products' help entry point for admins on the Admin Products page explaining minimal product creation steps and where Product Management lives.",
      "acceptanceCriteria": [
        "Admins can access a short help UI (e.g., a link/button in the Admin Products page header or a compact callout) that explains, in English, how to add products.",
        "The help content explicitly mentions that the Admin page is at /admin and the primary action is the existing “Add Product” button.",
        "The help content mentions that image URLs are entered one per line and are optional.",
        "No changes are required to Internet Identity hooks or immutable paths to deliver this help UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Add a compact, always-visible help entry point for admins in the page header (e.g., a small Button that opens a Dialog). The help content must be in English and briefly list the minimum steps (name, price, category, stock, optional image URLs) and explicitly state that Product Management is at /admin and that the primary action is the existing “Add Product” button. Explicitly mention image URLs are optional and entered one per line. Do not modify Internet Identity hooks. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Improve Admin Products table loading and empty states so admins can distinguish loading vs no products, without breaking existing table actions.",
      "acceptanceCriteria": [
        "While loading, the Admin Products page shows a clear loading indicator in the table area.",
        "When loading is complete and there are no products, the Admin Products page shows an explicit empty state (in English) such as “No products yet. Click ‘Add Product’ to create your first product.”",
        "When products exist, the current table rendering remains functional (edit and activate/deactivate actions still work)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Update the CardContent/table rendering to (1) show a clear loading indicator within the table area while isLoading is true (e.g., a spinner row or table-area skeleton), and (2) after loading, if products is empty, show an explicit English empty-state message (e.g., “No products yet. Click ‘Add Product’ to create your first product.”) in the table area. Preserve the existing table and row actions when products exist. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}