{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend bootstrap-claim wiring and post-claim admin UI transition",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Update the /admin bootstrap-claim mutation to pass the password to the backend and ensure admin/bootstrap queries refetch so the UI immediately transitions from Access Denied to the AdminPage unlock screen.",
      "acceptanceCriteria": [
        "From /admin, when logged in with Internet Identity and not an admin, if bootstrap is available and the user enters password miang275@, clicking “Claim Admin Access” results in the user becoming an admin without a page refresh.",
        "After a successful claim, the UI no longer shows the Access Denied gating screen and instead proceeds to the Admin password unlock screen (handled by AdminPage).",
        "If the backend returns an incorrect-password error, the UI shows a clear English error message and remains on the bootstrap claim screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix useClaimAdminBootstrap to call the corrected backend bootstrap-claim method by passing adminPassword to actor.requestBootstrap(adminPassword). Remove any security-relevant reliance on a frontend-only password check (optional lightweight client-side validation can remain for UX, but backend errors must be handled). Improve error mapping so backend authorization/trap messages (including incorrect-password) become clear English errors. Ensure React Query invalidation/refetch of ['isAdmin'] and ['bootstrapAvailable'] remains so AdminGate re-renders into AdminPage immediately. Use the authorization component guidance for handling authorization/trap errors gracefully in the UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminGate.tsx",
          "operation": "modify",
          "description": "Adjust bootstrap-claim UI behavior to align with the corrected mutation: keep submitting the entered password, and display a clear English error for incorrect password returned from the backend (without requiring a refresh). Ensure the gating screen transitions away immediately once isAdmin becomes true (after query refetch) so the user reaches the AdminPage password unlock screen. Use the authorization component guidance for access control UI and error handling; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}